name: "python_backend_batch"
backend: "python"
max_batch_size: 4
input [
  {
    name: "uid"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]
output [
  {
    name: "uid"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }

]

dynamic_batching {
  max_queue_delay_microseconds: 1000000
}

instance_group [{count: 1, kind: KIND_CPU}]